7767517
181 191
Input            input.1                  0 1 input.1
Convolution      315                      1 1 input.1 315 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        316                      1 1 315 316 0=32
Clip             317                      1 1 316 317 0=0.000000e+00 1=6.000000e+00
Padding          318                      1 1 317 318 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
ConvolutionDepthWise 319                      1 1 318 319 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=288 7=32
BatchNorm        320                      1 1 319 320 0=32
Clip             321                      1 1 320 321 0=0.000000e+00 1=6.000000e+00
Convolution      322                      1 1 321 322 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        323                      1 1 322 323 0=16
Padding          324                      1 1 323 324 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      325                      1 1 324 325 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        326                      1 1 325 326 0=96
Clip             327                      1 1 326 327 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 328                      1 1 327 328 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=864 7=96
BatchNorm        329                      1 1 328 329 0=96
Clip             330                      1 1 329 330 0=0.000000e+00 1=6.000000e+00
Convolution      331                      1 1 330 331 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        332                      1 1 331 332 0=24
Split            splitncnn_0              1 2 332 332_splitncnn_0 332_splitncnn_1
Padding          333                      1 1 332_splitncnn_1 333 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      334                      1 1 333 334 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        335                      1 1 334 335 0=144
Clip             336                      1 1 335 336 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 337                      1 1 336 337 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1296 7=144
BatchNorm        338                      1 1 337 338 0=144
Clip             339                      1 1 338 339 0=0.000000e+00 1=6.000000e+00
Convolution      340                      1 1 339 340 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        341                      1 1 340 341 0=24
BinaryOp         342                      2 1 332_splitncnn_0 341 342 0=0
Padding          343                      1 1 342 343 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      344                      1 1 343 344 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456
BatchNorm        345                      1 1 344 345 0=144
Clip             346                      1 1 345 346 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 347                      1 1 346 347 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=1296 7=144
BatchNorm        348                      1 1 347 348 0=144
Clip             349                      1 1 348 349 0=0.000000e+00 1=6.000000e+00
Convolution      350                      1 1 349 350 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4608
BatchNorm        351                      1 1 350 351 0=32
Split            splitncnn_1              1 2 351 351_splitncnn_0 351_splitncnn_1
Padding          352                      1 1 351_splitncnn_1 352 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      353                      1 1 352 353 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        354                      1 1 353 354 0=192
Clip             355                      1 1 354 355 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 356                      1 1 355 356 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728 7=192
BatchNorm        357                      1 1 356 357 0=192
Clip             358                      1 1 357 358 0=0.000000e+00 1=6.000000e+00
Convolution      359                      1 1 358 359 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        360                      1 1 359 360 0=32
BinaryOp         361                      2 1 351_splitncnn_0 360 361 0=0
Split            splitncnn_2              1 2 361 361_splitncnn_0 361_splitncnn_1
Padding          362                      1 1 361_splitncnn_1 362 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      363                      1 1 362 363 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        364                      1 1 363 364 0=192
Clip             365                      1 1 364 365 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 366                      1 1 365 366 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728 7=192
BatchNorm        367                      1 1 366 367 0=192
Clip             368                      1 1 367 368 0=0.000000e+00 1=6.000000e+00
Convolution      369                      1 1 368 369 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        370                      1 1 369 370 0=32
BinaryOp         371                      2 1 361_splitncnn_0 370 371 0=0
Padding          372                      1 1 371 372 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      373                      1 1 372 373 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        374                      1 1 373 374 0=192
Clip             375                      1 1 374 375 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 376                      1 1 375 376 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=1728 7=192
BatchNorm        377                      1 1 376 377 0=192
Clip             378                      1 1 377 378 0=0.000000e+00 1=6.000000e+00
Convolution      379                      1 1 378 379 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=12288
BatchNorm        380                      1 1 379 380 0=64
Split            splitncnn_3              1 2 380 380_splitncnn_0 380_splitncnn_1
Padding          381                      1 1 380_splitncnn_1 381 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      382                      1 1 381 382 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        383                      1 1 382 383 0=384
Clip             384                      1 1 383 384 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 385                      1 1 384 385 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456 7=384
BatchNorm        386                      1 1 385 386 0=384
Clip             387                      1 1 386 387 0=0.000000e+00 1=6.000000e+00
Convolution      388                      1 1 387 388 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        389                      1 1 388 389 0=64
BinaryOp         390                      2 1 380_splitncnn_0 389 390 0=0
Split            splitncnn_4              1 2 390 390_splitncnn_0 390_splitncnn_1
Padding          391                      1 1 390_splitncnn_1 391 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      392                      1 1 391 392 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        393                      1 1 392 393 0=384
Clip             394                      1 1 393 394 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 395                      1 1 394 395 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456 7=384
BatchNorm        396                      1 1 395 396 0=384
Clip             397                      1 1 396 397 0=0.000000e+00 1=6.000000e+00
Convolution      398                      1 1 397 398 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        399                      1 1 398 399 0=64
BinaryOp         400                      2 1 390_splitncnn_0 399 400 0=0
Split            splitncnn_5              1 2 400 400_splitncnn_0 400_splitncnn_1
Padding          401                      1 1 400_splitncnn_1 401 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      402                      1 1 401 402 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        403                      1 1 402 403 0=384
Clip             404                      1 1 403 404 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 405                      1 1 404 405 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456 7=384
BatchNorm        406                      1 1 405 406 0=384
Clip             407                      1 1 406 407 0=0.000000e+00 1=6.000000e+00
Convolution      408                      1 1 407 408 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        409                      1 1 408 409 0=64
BinaryOp         410                      2 1 400_splitncnn_0 409 410 0=0
Padding          411                      1 1 410 411 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      412                      1 1 411 412 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=24576
BatchNorm        413                      1 1 412 413 0=384
Clip             414                      1 1 413 414 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 415                      1 1 414 415 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3456 7=384
BatchNorm        416                      1 1 415 416 0=384
Clip             417                      1 1 416 417 0=0.000000e+00 1=6.000000e+00
Convolution      418                      1 1 417 418 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=36864
BatchNorm        419                      1 1 418 419 0=96
Split            splitncnn_6              1 2 419 419_splitncnn_0 419_splitncnn_1
Padding          420                      1 1 419_splitncnn_1 420 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      421                      1 1 420 421 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        422                      1 1 421 422 0=576
Clip             423                      1 1 422 423 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 424                      1 1 423 424 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=5184 7=576
BatchNorm        425                      1 1 424 425 0=576
Clip             426                      1 1 425 426 0=0.000000e+00 1=6.000000e+00
Convolution      427                      1 1 426 427 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        428                      1 1 427 428 0=96
BinaryOp         429                      2 1 419_splitncnn_0 428 429 0=0
Split            splitncnn_7              1 2 429 429_splitncnn_0 429_splitncnn_1
Padding          430                      1 1 429_splitncnn_1 430 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      431                      1 1 430 431 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        432                      1 1 431 432 0=576
Clip             433                      1 1 432 433 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 434                      1 1 433 434 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=5184 7=576
BatchNorm        435                      1 1 434 435 0=576
Clip             436                      1 1 435 436 0=0.000000e+00 1=6.000000e+00
Convolution      437                      1 1 436 437 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        438                      1 1 437 438 0=96
BinaryOp         439                      2 1 429_splitncnn_0 438 439 0=0
Padding          440                      1 1 439 440 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      441                      1 1 440 441 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=55296
BatchNorm        442                      1 1 441 442 0=576
Clip             443                      1 1 442 443 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 444                      1 1 443 444 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=5184 7=576
BatchNorm        445                      1 1 444 445 0=576
Clip             446                      1 1 445 446 0=0.000000e+00 1=6.000000e+00
Convolution      447                      1 1 446 447 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=92160
BatchNorm        448                      1 1 447 448 0=160
Split            splitncnn_8              1 2 448 448_splitncnn_0 448_splitncnn_1
Padding          449                      1 1 448_splitncnn_1 449 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      450                      1 1 449 450 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        451                      1 1 450 451 0=960
Clip             452                      1 1 451 452 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 453                      1 1 452 453 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8640 7=960
BatchNorm        454                      1 1 453 454 0=960
Clip             455                      1 1 454 455 0=0.000000e+00 1=6.000000e+00
Convolution      456                      1 1 455 456 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        457                      1 1 456 457 0=160
BinaryOp         458                      2 1 448_splitncnn_0 457 458 0=0
Split            splitncnn_9              1 2 458 458_splitncnn_0 458_splitncnn_1
Padding          459                      1 1 458_splitncnn_1 459 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      460                      1 1 459 460 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        461                      1 1 460 461 0=960
Clip             462                      1 1 461 462 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 463                      1 1 462 463 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8640 7=960
BatchNorm        464                      1 1 463 464 0=960
Clip             465                      1 1 464 465 0=0.000000e+00 1=6.000000e+00
Convolution      466                      1 1 465 466 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        467                      1 1 466 467 0=160
BinaryOp         468                      2 1 458_splitncnn_0 467 468 0=0
Padding          469                      1 1 468 469 0=1 1=1 2=1 3=1 4=0 5=0.000000e+00
Convolution      470                      1 1 469 470 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=153600
BatchNorm        471                      1 1 470 471 0=960
Clip             472                      1 1 471 472 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise 473                      1 1 472 473 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8640 7=960
BatchNorm        474                      1 1 473 474 0=960
Clip             475                      1 1 474 475 0=0.000000e+00 1=6.000000e+00
Convolution      476                      1 1 475 476 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=307200
BatchNorm        477                      1 1 476 477 0=320
Convolution      478                      1 1 477 478 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=409600
BatchNorm        479                      1 1 478 479 0=1280
Clip             480                      1 1 479 480 0=0.000000e+00 1=6.000000e+00
Pooling          481                      1 1 480 481 0=1 4=1
Reshape          483                      1 1 481 483 0=1280
InnerProduct     484                      1 1 483 484 0=2 1=1 2=2560
Softmax          485                      1 1 484 485 0=0 1=1
