7767517
112 122
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 486 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_1                   1 1 486 317 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_3                   1 1 317 489 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_4                   1 1 489 321 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_5                   1 1 321 492 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_7                   1 1 492 495 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1536
Clip             Clip_8                   1 1 495 327 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_9                   1 1 327 498 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=864 7=96
Clip             Clip_10                  1 1 498 330 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_11                  1 1 330 501 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 501 501_splitncnn_0 501_splitncnn_1
Convolution      Conv_13                  1 1 501_splitncnn_1 504 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
Clip             Clip_14                  1 1 504 336 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_15                  1 1 336 507 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1296 7=144
Clip             Clip_16                  1 1 507 339 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_17                  1 1 339 510 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_18                   2 1 501_splitncnn_0 510 342 0=0
Convolution      Conv_20                  1 1 342 513 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
Clip             Clip_21                  1 1 513 346 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_22                  1 1 346 516 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=1296 7=144
Clip             Clip_23                  1 1 516 349 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_24                  1 1 349 519 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_1              1 2 519 519_splitncnn_0 519_splitncnn_1
Convolution      Conv_26                  1 1 519_splitncnn_1 522 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6144
Clip             Clip_27                  1 1 522 355 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_28                  1 1 355 525 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728 7=192
Clip             Clip_29                  1 1 525 358 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_30                  1 1 358 528 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_31                   2 1 519_splitncnn_0 528 361 0=0
Split            splitncnn_2              1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution      Conv_33                  1 1 361_splitncnn_1 531 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6144
Clip             Clip_34                  1 1 531 365 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_35                  1 1 365 534 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728 7=192
Clip             Clip_36                  1 1 534 368 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_37                  1 1 368 537 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_38                   2 1 361_splitncnn_0 537 371 0=0
Convolution      Conv_40                  1 1 371 540 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6144
Clip             Clip_41                  1 1 540 375 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_42                  1 1 375 543 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=1728 7=192
Clip             Clip_43                  1 1 543 378 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_44                  1 1 378 546 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_3              1 2 546 546_splitncnn_0 546_splitncnn_1
Convolution      Conv_46                  1 1 546_splitncnn_1 549 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=24576
Clip             Clip_47                  1 1 549 384 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_48                  1 1 384 552 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456 7=384
Clip             Clip_49                  1 1 552 387 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_50                  1 1 387 555 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_51                   2 1 546_splitncnn_0 555 390 0=0
Split            splitncnn_4              1 2 390 390_splitncnn_0 390_splitncnn_1
Convolution      Conv_53                  1 1 390_splitncnn_1 558 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=24576
Clip             Clip_54                  1 1 558 394 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_55                  1 1 394 561 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456 7=384
Clip             Clip_56                  1 1 561 397 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_57                  1 1 397 564 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_58                   2 1 390_splitncnn_0 564 400 0=0
Split            splitncnn_5              1 2 400 400_splitncnn_0 400_splitncnn_1
Convolution      Conv_60                  1 1 400_splitncnn_1 567 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=24576
Clip             Clip_61                  1 1 567 404 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_62                  1 1 404 570 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456 7=384
Clip             Clip_63                  1 1 570 407 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_64                  1 1 407 573 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_65                   2 1 400_splitncnn_0 573 410 0=0
Convolution      Conv_67                  1 1 410 576 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=24576
Clip             Clip_68                  1 1 576 414 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_69                  1 1 414 579 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456 7=384
Clip             Clip_70                  1 1 579 417 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_71                  1 1 417 582 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_6              1 2 582 582_splitncnn_0 582_splitncnn_1
Convolution      Conv_73                  1 1 582_splitncnn_1 585 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Clip             Clip_74                  1 1 585 423 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_75                  1 1 423 588 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184 7=576
Clip             Clip_76                  1 1 588 426 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_77                  1 1 426 591 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_78                   2 1 582_splitncnn_0 591 429 0=0
Split            splitncnn_7              1 2 429 429_splitncnn_0 429_splitncnn_1
Convolution      Conv_80                  1 1 429_splitncnn_1 594 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Clip             Clip_81                  1 1 594 433 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_82                  1 1 433 597 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5184 7=576
Clip             Clip_83                  1 1 597 436 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_84                  1 1 436 600 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_85                   2 1 429_splitncnn_0 600 439 0=0
Convolution      Conv_87                  1 1 439 603 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=55296
Clip             Clip_88                  1 1 603 443 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_89                  1 1 443 606 0=576 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=5184 7=576
Clip             Clip_90                  1 1 606 446 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_91                  1 1 446 609 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_8              1 2 609 609_splitncnn_0 609_splitncnn_1
Convolution      Conv_93                  1 1 609_splitncnn_1 612 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=153600
Clip             Clip_94                  1 1 612 452 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_95                  1 1 452 615 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8640 7=960
Clip             Clip_96                  1 1 615 455 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_97                  1 1 455 618 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_98                   2 1 609_splitncnn_0 618 458 0=0
Split            splitncnn_9              1 2 458 458_splitncnn_0 458_splitncnn_1
Convolution      Conv_100                 1 1 458_splitncnn_1 621 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=153600
Clip             Clip_101                 1 1 621 462 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_102                 1 1 462 624 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8640 7=960
Clip             Clip_103                 1 1 624 465 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_104                 1 1 465 627 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_105                  2 1 458_splitncnn_0 627 468 0=0
Convolution      Conv_107                 1 1 468 630 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=153600
Clip             Clip_108                 1 1 630 472 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_109                 1 1 472 633 0=960 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8640 7=960
Clip             Clip_110                 1 1 633 475 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_111                 1 1 475 636 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Convolution      Conv_112                 1 1 636 639 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=409600
Clip             Clip_113                 1 1 639 480 0=0.000000e+00 1=6.000000e+00
Pooling          GlobalAveragePool_114    1 1 480 481 0=1 4=1
Reshape          Reshape_116              1 1 481 483 0=1280
InnerProduct     Gemm_117                 1 1 483 484 0=2 1=1 2=2560
Softmax          Softmax_118              1 1 484 485 0=0 1=1
