7767517
157 172
Input            input.1                  0 1 input.1
Convolution      Conv_0                   1 1 input.1 730 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Mul_5                    1 1 730 253 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_6                   1 1 253 733 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_7                   1 1 733 256
Split            splitncnn_0              1 2 256 256_splitncnn_0 256_splitncnn_1
Pooling          GlobalAveragePool_14     1 1 256_splitncnn_1 263 0=1 4=1
Reshape          Reshape_18               1 1 263 267 0=16
InnerProduct     Gemm_19                  1 1 267 268 0=8 1=1 2=128
ReLU             Relu_20                  1 1 268 269
InnerProduct     Gemm_21                  1 1 269 270 0=16 1=1 2=128
HardSigmoid      Div_25                   1 1 270 276 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_29               1 1 276 284 0=1 1=1 2=16
BinaryOp         Mul_30                   2 1 256_splitncnn_0 284 285 0=2
Convolution      Conv_31                  1 1 285 736 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_32                  1 1 736 739 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
ReLU             Relu_33                  1 1 739 290
ConvolutionDepthWise Conv_34                  1 1 290 742 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_35                  1 1 742 293
Convolution      Conv_36                  1 1 293 745 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
Split            splitncnn_1              1 2 745 745_splitncnn_0 745_splitncnn_1
Convolution      Conv_37                  1 1 745_splitncnn_1 748 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             Relu_38                  1 1 748 298
ConvolutionDepthWise Conv_39                  1 1 298 751 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
ReLU             Relu_40                  1 1 751 301
Convolution      Conv_41                  1 1 301 754 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
BinaryOp         Add_42                   2 1 745_splitncnn_0 754 304 0=0
Convolution      Conv_43                  1 1 304 757 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
HardSwish        Mul_48                   1 1 757 313 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_49                  1 1 313 760 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
Split            splitncnn_2              1 2 760 760_splitncnn_0 760_splitncnn_1
Pooling          GlobalAveragePool_56     1 1 760_splitncnn_1 322 0=1 4=1
Reshape          Reshape_60               1 1 322 326 0=96
InnerProduct     Gemm_61                  1 1 326 327 0=24 1=1 2=2304
ReLU             Relu_62                  1 1 327 328
InnerProduct     Gemm_63                  1 1 328 329 0=96 1=1 2=2304
HardSigmoid      Div_67                   1 1 329 335 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_71               1 1 335 343 0=1 1=1 2=96
BinaryOp         Mul_72                   2 1 760_splitncnn_0 343 344 0=2
HardSwish        Mul_77                   1 1 344 351 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_78                  1 1 351 763 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
Split            splitncnn_3              1 2 763 763_splitncnn_0 763_splitncnn_1
Convolution      Conv_79                  1 1 763_splitncnn_1 766 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
HardSwish        Mul_84                   1 1 766 362 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_85                  1 1 362 769 0=192 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=4800 7=192
Split            splitncnn_4              1 2 769 769_splitncnn_0 769_splitncnn_1
Pooling          GlobalAveragePool_92     1 1 769_splitncnn_1 371 0=1 4=1
Reshape          Reshape_96               1 1 371 375 0=192
InnerProduct     Gemm_97                  1 1 375 376 0=48 1=1 2=9216
ReLU             Relu_98                  1 1 376 377
InnerProduct     Gemm_99                  1 1 377 378 0=192 1=1 2=9216
HardSigmoid      Div_103                  1 1 378 384 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_107              1 1 384 392 0=1 1=1 2=192
BinaryOp         Mul_108                  2 1 769_splitncnn_0 392 393 0=2
HardSwish        Mul_113                  1 1 393 400 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_114                 1 1 400 772 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_115                  2 1 763_splitncnn_0 772 403 0=0
Split            splitncnn_5              1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution      Conv_116                 1 1 403_splitncnn_1 775 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
HardSwish        Mul_121                  1 1 775 412 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_122                 1 1 412 778 0=192 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=4800 7=192
Split            splitncnn_6              1 2 778 778_splitncnn_0 778_splitncnn_1
Pooling          GlobalAveragePool_129    1 1 778_splitncnn_1 421 0=1 4=1
Reshape          Reshape_133              1 1 421 425 0=192
InnerProduct     Gemm_134                 1 1 425 426 0=48 1=1 2=9216
ReLU             Relu_135                 1 1 426 427
InnerProduct     Gemm_136                 1 1 427 428 0=192 1=1 2=9216
HardSigmoid      Div_140                  1 1 428 434 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_144              1 1 434 442 0=1 1=1 2=192
BinaryOp         Mul_145                  2 1 778_splitncnn_0 442 443 0=2
HardSwish        Mul_150                  1 1 443 450 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_151                 1 1 450 781 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_152                  2 1 403_splitncnn_0 781 453 0=0
Convolution      Conv_153                 1 1 453 784 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3072
HardSwish        Mul_158                  1 1 784 462 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_159                 1 1 462 787 0=96 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=2400 7=96
Split            splitncnn_7              1 2 787 787_splitncnn_0 787_splitncnn_1
Pooling          GlobalAveragePool_166    1 1 787_splitncnn_1 471 0=1 4=1
Reshape          Reshape_170              1 1 471 475 0=96
InnerProduct     Gemm_171                 1 1 475 476 0=24 1=1 2=2304
ReLU             Relu_172                 1 1 476 477
InnerProduct     Gemm_173                 1 1 477 478 0=96 1=1 2=2304
HardSigmoid      Div_177                  1 1 478 484 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_181              1 1 484 492 0=1 1=1 2=96
BinaryOp         Mul_182                  2 1 787_splitncnn_0 492 493 0=2
HardSwish        Mul_187                  1 1 493 500 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_188                 1 1 500 790 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3840
Split            splitncnn_8              1 2 790 790_splitncnn_0 790_splitncnn_1
Convolution      Conv_189                 1 1 790_splitncnn_1 793 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
HardSwish        Mul_194                  1 1 793 511 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_195                 1 1 511 796 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_9              1 2 796 796_splitncnn_0 796_splitncnn_1
Pooling          GlobalAveragePool_202    1 1 796_splitncnn_1 520 0=1 4=1
Reshape          Reshape_206              1 1 520 524 0=120
InnerProduct     Gemm_207                 1 1 524 525 0=32 1=1 2=3840
ReLU             Relu_208                 1 1 525 526
InnerProduct     Gemm_209                 1 1 526 527 0=120 1=1 2=3840
HardSigmoid      Div_213                  1 1 527 533 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_217              1 1 533 541 0=1 1=1 2=120
BinaryOp         Mul_218                  2 1 796_splitncnn_0 541 542 0=2
HardSwish        Mul_223                  1 1 542 549 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_224                 1 1 549 799 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_225                  2 1 790_splitncnn_0 799 552 0=0
Convolution      Conv_226                 1 1 552 802 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Mul_231                  1 1 802 561 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_232                 1 1 561 805 0=240 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=6000 7=240
Split            splitncnn_10             1 2 805 805_splitncnn_0 805_splitncnn_1
Pooling          GlobalAveragePool_239    1 1 805_splitncnn_1 570 0=1 4=1
Reshape          Reshape_243              1 1 570 574 0=240
InnerProduct     Gemm_244                 1 1 574 575 0=64 1=1 2=15360
ReLU             Relu_245                 1 1 575 576
InnerProduct     Gemm_246                 1 1 576 577 0=240 1=1 2=15360
HardSigmoid      Div_250                  1 1 577 583 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_254              1 1 583 591 0=1 1=1 2=240
BinaryOp         Mul_255                  2 1 805_splitncnn_0 591 592 0=2
HardSwish        Mul_260                  1 1 592 599 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_261                 1 1 599 808 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=17280
Split            splitncnn_11             1 2 808 808_splitncnn_0 808_splitncnn_1
Convolution      Conv_262                 1 1 808_splitncnn_1 811 0=432 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=31104
HardSwish        Mul_267                  1 1 811 610 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_268                 1 1 610 814 0=432 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=10800 7=432
Split            splitncnn_12             1 2 814 814_splitncnn_0 814_splitncnn_1
Pooling          GlobalAveragePool_275    1 1 814_splitncnn_1 619 0=1 4=1
Reshape          Reshape_279              1 1 619 623 0=432
InnerProduct     Gemm_280                 1 1 623 624 0=112 1=1 2=48384
ReLU             Relu_281                 1 1 624 625
InnerProduct     Gemm_282                 1 1 625 626 0=432 1=1 2=48384
HardSigmoid      Div_286                  1 1 626 632 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_290              1 1 632 640 0=1 1=1 2=432
BinaryOp         Mul_291                  2 1 814_splitncnn_0 640 641 0=2
HardSwish        Mul_296                  1 1 641 648 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_297                 1 1 648 817 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=31104
BinaryOp         Add_298                  2 1 808_splitncnn_0 817 651 0=0
Split            splitncnn_13             1 2 651 651_splitncnn_0 651_splitncnn_1
Convolution      Conv_299                 1 1 651_splitncnn_1 820 0=432 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=31104
HardSwish        Mul_304                  1 1 820 660 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_305                 1 1 660 823 0=432 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=10800 7=432
Split            splitncnn_14             1 2 823 823_splitncnn_0 823_splitncnn_1
Pooling          GlobalAveragePool_312    1 1 823_splitncnn_1 669 0=1 4=1
Reshape          Reshape_316              1 1 669 673 0=432
InnerProduct     Gemm_317                 1 1 673 674 0=112 1=1 2=48384
ReLU             Relu_318                 1 1 674 675
InnerProduct     Gemm_319                 1 1 675 676 0=432 1=1 2=48384
HardSigmoid      Div_323                  1 1 676 682 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_327              1 1 682 690 0=1 1=1 2=432
BinaryOp         Mul_328                  2 1 823_splitncnn_0 690 691 0=2
HardSwish        Mul_333                  1 1 691 698 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_334                 1 1 698 826 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=31104
BinaryOp         Add_335                  2 1 651_splitncnn_0 826 701 0=0
Convolution      Conv_336                 1 1 701 829 0=432 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=31104
HardSwish        Mul_341                  1 1 829 710 0=1.666667e-01 1=5.000000e-01
Pooling          GlobalAveragePool_342    1 1 710 711 0=1 4=1
Reshape          Reshape_348              1 1 711 719 0=-1
InnerProduct     Gemm_349                 1 1 719 720 0=1024 1=1 2=442368
HardSwish        Mul_354                  1 1 720 727 0=1.666667e-01 1=5.000000e-01
InnerProduct     Gemm_355                 1 1 727 728 0=2 1=1 2=2048
Sigmoid          Sigmoid_356              1 1 728 729
